Repository: Merna-Hesham/shopping_project
Catalog: lib/l10n/app_*.arb
Languages: ar

# appName
source: Shopify
ar: شوبيفاي

# welcomeText
source: Let's go shopping
ar: هيا نتسوق

source: Sign Up
ar: إنشاء حساب

source: Sign In
ar: تسجيل الدخول

source: Create New Account
ar: إنشاء حساب جديد

# joinToday
source: Join Shopify today
ar: انضم إلى شوبيفاي اليوم

source: Full Name
ar: الاسم الكامل

source: Email
ar: البريد الإلكتروني

source: Password
ar: كلمة المرور

source: Confirm Password
ar: تأكيد كلمة المرور

# fullNameLabel
source: Enter your full Name
ar: ادخل الاسم الكامل

# emailLabel
source: Enter your email
ar: ادخل البريد الإلكتروني

# passwordLabel
source: Enter your password
ar: ادخل كلمة المرور

# confirmPasswordLabel
source: Confirm your password
ar: ادخل تأكيد كلمة المرور

# errorNameRequired
source: Full name is required
ar: الاسم الكامل مطلوب

# errorNameUppercase
source: First letter must be uppercase
ar: يجب أن يبدأ الاسم بحرف كبير

# errorEmailRequired
source: Email is required
ar: البريد الإلكتروني مطلوب

# errorEmailInvalid
source: Email must contain @
ar: يجب أن يحتوي البريد الإلكتروني على @

# errorPasswordRequired
source: Password is required
ar: كلمة المرور مطلوبة

# errorPasswordShort
source: Password must be at least 6 characters
ar: يجب ألا تقل كلمة المرور عن 6 أحرف

# errorConfirmRequired
source: Confirm your password
ar: يرجى تأكيد كلمة المرور

# errorPasswordsMismatch
source: Passwords do not match
ar: كلمتا المرور غير متطابقتين

source: Create Account
ar: إنشاء حساب جديد

source: Success!
ar: تم بنجاح!

# accountCreated
source: Account created successfully
ar: تم إنشاء الحساب بنجاح

source: Close
ar: إغلاق

source: Welcome Back
ar: مرحبًا بعودتك

# signInTo
source: Sign in to Shopify
ar: سجل الدخول إلى شوبيفاي

source: Welcome!
ar: اهلا!

# accountSignedIn
source: Account sign-in successfully
ar: تم تسجيل الدخول بنجاح

source: Our Products
ar: منتجاتنا

source: Featured Products
ar: المنتجات المميزة

# shopCollection
source: Shop Our Collection
ar: تسوق مجموعتنا

source: Hot Offers
ar: العروض الساخنة

# addToCart
source: Product added to cart
ar: تمت إضافة المنتج إلى السلة

# addedToCart
source: {product} added to cart
ar: تمت إضافة {product} إلى السلة

# featured_t_shirts
source: T-shirts
ar: تيشيرتات

# featured_sweaters
source: Sweaters
ar: سويترات

# featured_jeans
source: Jeans Pants
ar: بنطلونات جينز

# product_beige_cardigan
source: Beige Cardigan
ar: كارديجان بيج

# product_beige_sweater
source: Beige Sweater
ar: سويتر بيج

# product_black_bag
source: Black Bag
ar: شنطة سوداء

# product_beige_boots
source: Beige Boots
ar: حذاء بيج

# price_600
source: 600 EGP
ar: ٦٠٠ جنيه

# price_700
source: 700 EGP
ar: ٧٠٠ جنيه

# price_1000
source: 1000 EGP
ar: ١٠٠٠ جنيه

# price_1200
source: 1200 EGP
ar: ١٢٠٠ جنيه

# price_300
source: 300 EGP
ar: ٣٠٠ جنيه

# price_1600
source: 1600 EGP
ar: ١٦٠٠ جنيه

# price_2000
source: 2000 EGP
ar: ٢٠٠٠ جنيه

# product_tshirt
source: T-shirt
ar: تيشيرت

# product_jeans_jacket
source: Jeans Jacket
ar: جاكيت جينز

# product_green_sweater
source: Green Sweater
ar: سويتر أخضر

# product_brown_jacket
source: Brown Jacket
ar: جاكيت بني

# product_red_heels
source: Red Heels
ar: كعب أحمر

# product_shoes
source: Shoes
ar: حذاء

# offer_buy2get1
source: Buy 2 Get 1 Free
ar: اشتري ٢ واحصل على ١ مجانًا

# offer_accessories
source: On selected accessories
ar: على الإكسسوارات المختارة

# offer_buy1get50
source: Buy 1 Get 2nd 50%
ar: اشتري ١ واحصل على الثاني بخصم ٥٠٪

# offer_heels
source: Limited time offer on selected heels
ar: عرض لفترة محدودة على الكعوب

# offer_50_tshirts
source: 50% Off On T-shirts
ar: خصم ٥٠٪ على التيشيرتات

# offer_tshirts
source: Limited time offer on all t-shirts
ar: عرض لفترة محدودة على كل التيشيرتات

# offer_bundle
source: Bundle Deals
ar: عروض الباقات

# offer_collection
source: Save more when you buy complete collection
ar: وفر أكثر عند شراء المجموعة الكاملة

# offer_free_shipping
source: Free Shipping Weekend
ar: توصيل مجاني في عطلة نهاية الأسبوع

# offer_shipping
source: No delivery charges on orders above 500 EGP
ar: لا توجد رسوم توصيل للطلبات فوق ٥٠٠ جنيه
